'''
Файл содержит настройки проекта
'''
import re

import numpy as np


SUBMISSION_COLUMNS = [
    'Проект',
    'Куст',
    'Количество добывающих скважин',
    'Количество нагнетательных скважин',
    'Вид строительства',
    'Абсолютный минимум температуры',
    'Абсолютный максимум температуры',
    'Средняя температура наиболее холодной пятидневки',
    'Среднемесячная температура самого холодного месяца',
    'Район сейсмичности',
    'Уровень ответственности объекта по 384-ФЗ от 30.12.2009',
    'Способ добычи',
    'Тип энергоснабжения',
    'Вариант прокладки нефтепроводов',
    'Вариант прокладки водоводов',
    'Добыча нефти, тыс. т / год',
    'Добыча жидкости, тыс. м3 / год',
    'Закачка воды, тыс. м3 / год',
    'Газовый фактор, м3 / т',
    'Плотность нефти, кг / м3',
    'Плотность газа, кг / м3',
    'Тип подключения к системе ППД',
    'Внутрикустовая закачка в систему ППД',
    'Схема внешнего электроснабжения',
    'Категория надежности электроснабжения',
    'Потребляемая мощность ЭЦН / ШГН, кВт'
]

PATTERNS = {
    'Куст': re.compile(
        r'куст\s*№\s*\d+|кустовая\s*площадка\s*№\s*\d+|'
        r'куст\s*скважин\s*№\s*\d+'
    )
}

MOST_FREQUENT_VALUES = {
    'Проект': 27,
    'Куст': '1',
    'Количество добывающих скважин': 9,
    'Количество нагнетательных скважин': 0,
    'Вид строительства': 'новое',
    'Абсолютный минимум температуры': -55.0,
    'Абсолютный максимум температуры': 34.0,
    'Средняя температура наиболее холодной пятидневки': np.NaN,
    'Среднемесячная температура самого холодного месяца': -22.0,
    'Район сейсмичности': 'не сейсмоопасный',
    'Уровень ответственности объекта по 384-ФЗ от 30.12.2009': 'повышенный',
    'Способ добычи': 'ЭЦН',
    'Тип энергоснабжения': 'внешний',
    'Вариант прокладки нефтепроводов': 'подземная',
    'Вариант прокладки водоводов': 'подземная',
    'Добыча нефти, тыс. т / год': np.NaN,
    'Добыча жидкости, тыс. м3 / год': np.NaN,
    'Закачка воды, тыс. м3 / год': np.NaN,
    'Газовый фактор, м3 / т': 63.0,
    'Плотность нефти, кг / м3': 854.0,
    'Плотность газа, кг / м3': 0.86,
    'Тип подключения к системе ППД': np.NaN,
    'Внутрикустовая закачка в систему ППД': 'нет',
    'Схема внешнего электроснабжения': 'БКРУ',
    'Категория надежности электроснабжения': 'I',
    'Потребляемая мощность ЭЦН / ШГН, кВт': np.NaN
}
